---
kind: type
id: T:Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator
source: html/9c3074cc-ffb7-a434-2ee6-644d28ac344b.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSetIterator

An iterator to a GroundConductorSize set.

## Syntax (C#)
```csharp
public abstract class GroundConductorSizeSetIterator : APIObject,
	IEnumerator
```